---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ConvertFaceRegionsToFacesFailed
source: html/93048872-1c51-8a60-980d-bff758730c31.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.ConvertFaceRegionsToFacesFailed Property

Failed to replace an instance face with its face regions.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConvertFaceRegionsToFacesFailed { get; }
```